In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/home/caldeirao/pipeline_dados/data_raw/salaries.csv')# Dataset com salários de profissionais de tecnologia nos EUA

In [3]:
df.head()# Dataset com salários de profissionais de tecnologia nos EUA

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [4]:
df.info()# Informaçõessobre o dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [5]:
df.describe()# Estatísticas descritivas do dataset

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [6]:
df.shape# Formato do dataset

(133349, 11)

In [7]:
linhas,colunas = df.shape[0], df.shape[1]# linhas e colunas do dataset
print('linhas:',linhas,'colunas:',colunas)# mostrar linhas e colunas

linhas: 133349 colunas: 11

In [8]:
df.columns# Colunas do dataset

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

                                           Renomeando as colunas do DataFrame

In [9]:
df.rename(columns={ # Renomeando colunas para português
    "work_year": "ano_trabalho",
    "experience_level": "nivel_experiencia",
    "employment_type": "tipo_contratacao",
    "job_title": "cargo",
    "salary": "salario",
    "salary_currency": "moeda_salario",
    "salary_in_usd": "salario_usd",
    "employee_residence": "residencia_funcionario",
    "remote_ratio": "percentual_remoto",
    "company_location": "local_empresa",
    "company_size": "porte_empresa"
}, inplace=True)

df.head()

,ano_trabalho,nivel_experiencia,tipo_contratacao,cargo,salario,moeda_salario,salario_usd,residencia_funcionario,percentual_remoto,local_empresa,porte_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

                                            Analisando quais sãos as categorias das colunas categóricas

In [ ]:
df['nivel_experiencia'].value_counts(), df['tipo_contratacao'].value_counts(), df['percentual_remoto'].value_counts(), df['porte_empresa'].value_counts() 
#data sobre níveis de experiência, tipo de contratação, percentual de trabalho remoto e porte da empresa

(nivel_experiencia
 SE    77241
 MI    40465
 EN    12443
 EX     3200
 Name: count, dtype: int64,
 tipo_contratacao
 FT    132563
 CT       394
 PT       376
 FL        16
 Name: count, dtype: int64,
 percentual_remoto
 0      105312
 100     27718
 50        319
 Name: count, dtype: int64,
 porte_empresa
 M    129561
 L      3574
 S       214
 Name: count, dtype: int64)

                                                    Modificando o nome das categorias:

In [ ]:
nivel_experiencia = { # Mapeando os níveis de experiência para português
    'SE': 'senior',
    'MI': 'pleno',
    'EN': 'junior',
    'EX': 'executivo'
}
df['nivel_experiencia'] = df['nivel_experiencia'].replace(nivel_experiencia)
df['nivel_experiencia'].value_counts()

nivel_experiencia
senior       77241
pleno        40465
junior       12443
executivo     3200
Name: count, dtype: int64

In [19]:
tipo_contratacao = {
    'FT': 'integral',
    'PT': 'parcial',
    'CT': 'contrato',
    'FL': 'freelancer'
}
df['tipo_contratacao'] = df['tipo_contratacao'].replace(tipo_contratacao)
df['tipo_contratacao'].value_counts()

tipo_contratacao
integral      132563
contrato         394
parcial          376
freelancer        16
Name: count, dtype: int64

In [21]:
porte_empresa = {
    'L': 'grande',
    'S': 'pequena',
    'M':	'media'

}
df['porte_empresa'] = df['porte_empresa'].replace(porte_empresa)
df['porte_empresa'].value_counts()

porte_empresa
media      129561
grande       3574
pequena       214
Name: count, dtype: int64

In [22]:
percentual_remoto = {
    0: 'presencial',
    100: 'remoto',
    50: 'hibrido'
}

df['percentual_remoto'] = df['percentual_remoto'].replace(percentual_remoto)
df['percentual_remoto'].value_counts()

percentual_remoto
presencial    105312
remoto         27718
hibrido          319
Name: count, dtype: int64

In [31]:
df.head()# Verificando as alterações feitas no dataset

,ano_trabalho,nivel_experiencia,tipo_contratacao,cargo,salario,moeda_salario,salario_usd,residencia_funcionario,percentual_remoto,local_empresa,porte_empresa
0,2025.0,senior,integral,Solutions Engineer,214000,USD,214000,US,remoto,US,media
1,2025.0,senior,integral,Solutions Engineer,136000,USD,136000,US,remoto,US,media
2,2025.0,pleno,integral,Data Engineer,158800,USD,158800,AU,presencial,AU,media
3,2025.0,pleno,integral,Data Engineer,139200,USD,139200,AU,presencial,AU,media
4,2025.0,junior,integral,Data Engineer,90000,USD,90000,US,presencial,US,media

In [ ]:
df.describe(include='object')# Estatísticas descritivas para colunas categóricas

,nivel_experiencia,tipo_contratacao,cargo,moeda_salario,residencia_funcionario,percentual_remoto,local_empresa,porte_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,senior,integral,Data Scientist,USD,US,presencial,US,media
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [34]:
df.head()# Verificando as alterações feitas no dataset

,ano_trabalho,nivel_experiencia,tipo_contratacao,cargo,salario,moeda_salario,salario_usd,residencia_funcionario,percentual_remoto,local_empresa,porte_empresa
0,2025.0,senior,integral,Solutions Engineer,214000,USD,214000,US,remoto,US,media
1,2025.0,senior,integral,Solutions Engineer,136000,USD,136000,US,remoto,US,media
2,2025.0,pleno,integral,Data Engineer,158800,USD,158800,AU,presencial,AU,media
3,2025.0,pleno,integral,Data Engineer,139200,USD,139200,AU,presencial,AU,media
4,2025.0,junior,integral,Data Engineer,90000,USD,90000,US,presencial,US,media

                                                Com isso já conseguimos responder algumas perguntas, como:

In [27]:
#Qual o nível de experiência mais comum na base de dados?
nivel_experiencia_most_common = df['nivel_experiencia'].mode()[0]
print(f'O nível de experiência mais comum é: {nivel_experiencia_most_common}')

O nível de experiência mais comum é: senior

In [28]:
#Qual é o tipo de contrato mais frequente?
tipo_contrato_most_common = df['tipo_contratacao'].mode()[0]
print(f'O tipo de contrato mais frequente é: {tipo_contrato_most_common}')

O tipo de contrato mais frequente é: integral

In [29]:
#Qual o cargo mais frequente na amostra?
cargo_most_common = df['cargo'].mode()[0]
print(f'O cargo mais frequente é: {cargo_most_common}')

O cargo mais frequente é: Data Scientist

In [ ]:
# De qual pais são a maioria dos profissionais da base?
residencia_funcionario_most_common = df['residencia_funcionario'].mode()[0]
print(f'O pais mais frequente é: {residencia_funcionario_most_common}')

O pais mais frequente é: US

In [35]:
#Qual é o país onde mais empresas da amostra estão sediadas?
local_empresa_most_common = df['local_empresa'].mode()[0]
print(f'O pais onde mais empresas da amostra estão sediadas é: {local_empresa_most_common}')

O pais onde mais empresas da amostra estão sediadas é: US

In [36]:
#Qual o regime de trabalho mais comum?
percentual_remoto_most_common = df['percentual_remoto'].mode()[0]
print(f'O regime de trabalho mais comum é: {percentual_remoto_most_common}')

O regime de trabalho mais comum é: presencial

In [38]:
#Qual é o tamanho mais comum das empresas na amostra?
porte_empresa_most_common = df['porte_empresa'].mode()[0]
print(f'O tamanho mais comum das empresas na amostra é: {porte_empresa_most_common}')

O tamanho mais comum das empresas na amostra é: media